using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class BugList : MonoBehaviour
{
    //BugList
    //#바뀐 골드의 배수값이 바로 적용이 안되고 업그레이드 해야 적용되는 버그
    //캐릭터 상세 스테이터스 창에서 실시간으로 불러오는 코드 적용시키면 메인에
    //있는 것도 해결될듯

    //#인벤토리에서 아이템을 다쓰고 다써서 없어진 아이템위치에다 다른 아이템을 놓고
    //다쓴 아이템을 새로 사면 아이템의 이미지가 중앙으로 이동됨

    //#영웅위치 변경에서 한 위치에 여러명의 영웅을 넣을 수 있음
    //#영웅위치 변경기능에서 영웅끼리 위치 교체하기 기능넣기

    //#가끔 전투가 끝나고 결과창을 닫으면 결과창이 안닫히고 전투씬만 닫치는 버그가 있음

    //스테이지를 클리어해도 다음 스테이지가 개방안되는 버그ㄴㄴㄴ
    //자동골드 흭득(퀘스트)가 가끔 멈추는 버그(스크립트(코드)적용시 멈춤)

    //인벤토리에서 슬릇이 표시가 안됨


    //일정 
    //전투씬에서 공격시 데미지뜨게하기
    //퀘스트 앱에 들어오면 그 시간동안 자동흭득한 골드 몰아받기(시간에 따라 골드 흭득하기)
    //인벤토리 그냥 간편한걸로 바꾸기, 버그가 너무 많아, 복잡해
    //밑에 메인 메뉴 6개에서 버튼 누르면 그 버튼 강조 하기
    //일주일 단위로 초기화 되는 무한의 탑
    //영웅레벨에 따른 스킬 제작
}
